---
kind: method
id: M:Autodesk.Revit.DB.IFCExportOptions.Assign(Autodesk.Revit.DB.IFCExportOptions)
zh: 赋值、设置值、写入
source: html/c0b5cf39-de55-a6fd-cc9d-dca8384f6f09.htm
---
# Autodesk.Revit.DB.IFCExportOptions.Assign Method

**中文**: 赋值、设置值、写入

Assigns the values of the IFCExportOptions to this options object.

## Syntax (C#)
```csharp
public void Assign(
	IFCExportOptions sourceOptions
)
```

## Parameters
- **sourceOptions** (`Autodesk.Revit.DB.IFCExportOptions`) - The source IFCExportOptions.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null